<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Portf&oacute;lio - Felipe Silva Pinheiro Sales</title>
  <style>
    body {
      margin: 0;
      font-family: 'Segoe UI', Tahoma, Geneva, Verdana, sans-serif;
      background-color: #f5f5f5;
      color: #333;
      line-height: 1.6;
    }
    .container {
      max-width: 1200px;
      margin: 50px auto;
      background-color: #fff;
      box-shadow: 0 4px 12px rgba(0, 0, 0, 0.1);
      border-radius: 12px;
      overflow: hidden;
      display: flex;
      flex-direction: row;
    }
    .sidebar {
      width: 300px;
      background-color: #f0f0f0;
      padding: 30px 20px;
      display: flex;
      flex-direction: column;
      align-items: center;
    }
    .photo-side {
      width: 180px;
      height: 180px;
      border-radius: 50%;
      overflow: hidden;
      margin-bottom: 20px;
      border: 4px solid #007BFF;
    }
    .photo-side img {
      width: 100%;
      height: 100%;
      object-fit: cover;
    }
    .contact {
      text-align: center;
      font-size: 14px;
      color: #333;
      margin-top: 10px;
    }
    .contact p {
      margin: 5px 0;
    }
    h1 {
      font-size: 28px;
      color: #007BFF;
      margin-top: 0;
    }
    .section {
      margin-bottom: 30px;
    }
    .section h2 {
      font-size: 20px;
      color: #0056b3;
      border-bottom: 2px solid #007BFF;
      padding-bottom: 5px;
      margin-bottom: 10px;
    }
    .content {
      flex: 1;
      padding: 30px 40px;
    }
    ul {
      padding-left: 20px;
    }
    ul li {
      margin-bottom: 10px;
    }
    @media (max-width: 768px) {
      .container {
        flex-direction: column;
      }
      .sidebar {
        width: 100%;
      }
    }
  </style>
</head>
<body>
  <div class="container">
    <div class="sidebar">
      <div class="photo-side">
        <img src="foto.jpg" alt="Minha Foto">
      </div>
      <div class="contact">
        <p><strong>Telefone:</strong> (11) 9 53858 - 8526</p>
        <p><strong>LinkedIn:</strong> <a href="https://www.linkedin.com/in/felipe-silva-pinheiro-sales" target="_blank">/felipe-silva-pinheiro-sales</a></p>
        <p><strong>Reside:</strong> S&atilde;o Paulo/SP</p>
      </div>
      <div class="section">
        <h2>Conhecimentos e Compet&ecirc;ncias</h2>
        <ul>
          <li>Linguagens: Delphi, Pascal, Java</li>
          <li>Frameworks: Spring Boot, Spring Data, Spring Cloud</li>
          <li>Bancos: DB2, Firebird, SQL Server, Oracle, MySQL, MongoDB</li>
          <li>Cloud e DevOps: Azure, AWS, OpenShift, Kubernetes, EKS, AKS, Databricks</li>
          <li>Mensageria: Kafka, RabbitMQ, SNS, SQS</li>
          <li>Ferramentas: Maven, GitHub, Splunk, Grafana, Dynatrace, Control-M, WebSphere, IBM MQ, Apigee, Kibana</li>
        </ul>
      </div>
    </div>
    <div class="content">
      <h1>Felipe Silva Pinheiro Sales</h1>
	  
	  <div class="section">
        <h2>Sobre</h2>
        <p>Com mais de 9 anos de experi&ecirc;ncia em tecnologia da informa&ccedil;&atilde;o, atuo como Senior Information Technology System Analyst no Santander Tecnologia Brasil. Meu foco est&aacute; em garantir a continuidade e integridade de aplica&ccedil;&otilde;es cr&iacute;ticas, especialmente nas &aacute;reas de mensageria, antifraude e seguran&ccedil;a. Trabalhei com ferramentas como Splunk, Grafana, ServiceNow, ambientes cloud (AWS, Azure, OpenShift) e tecnologias como Kubernetes, Kafka, MongoDB, al&eacute;m de desenvolvimento em Java e pr&aacute;ticas DevOps.</p>
      </div>
	  
      <div class="section">
        <h2>Experi&ecirc;ncias Profissionais</h2>
        <h3>Santander</h3>
        <p>Experi&ecirc;ncia em suporte de aplica&ccedil;&otilde;es cr&iacute;ticas com foco em mensageria, antifraude e seguran&ccedil;a, garantindo a continuidade dos servi&ccedil;os e a integridade dos sistemas. Conhecimento em ferramentas como Splunk, Grafana, Dynatrace, Control-M, ServiceNow, WebSphere, IBM MQ, Apigee e Kibana para monitoramento, an&aacute;lise de logs e resolu&ccedil;&atilde;o de incidentes de alta complexidade.<br>
Tenho experi&ecirc;ncia s&oacute;lida em ambientes cloud (Azure, AWS, OpenShift), atuando com EKS, AKS, Kubernetes, Kafka, MongoDB e Databricks, assegurando performance e alta disponibilidade das solu&ccedil;&otilde;es.<br>
Desenvolvimento em Java, Spring, Spring Boot, Maven, versionamento com GitHub e automa&ccedil;&otilde;es com pr&aacute;ticas de CI/CD, al&eacute;m de trabalhar com bancos de dados como Oracle, MySQL e SQL Server.<br>
Nos &uacute;ltimos dois anos, venho exercendo a fun&ccedil;&atilde;o de Tech Lead, liderando uma equipe de desenvolvedores focada na evolu&ccedil;&atilde;o de aplica&ccedil;&otilde;es cr&iacute;ticas, com especial aten&ccedil;&atilde;o &agrave; mitiga&ccedil;&atilde;o de vulnerabilidades e moderniza&ccedil;&atilde;o de sistemas obsoletos.</p>

        <h3>Gocil</h3>
        <p>Respons&aacute;vel pelo desenvolvimento e moderniza&ccedil;&atilde;o de um sistema para controle de contratos e gerenciamento de equipamentos, incluindo a implementa&ccedil;&atilde;o de funcionalidades para relat&oacute;rios e gr&aacute;ficos mensais. Migra&ccedil;&atilde;o de sistema legado em Pascal para nova plataforma em Java 8 com Spring Framework (Spring Boot, Spring MVC, Spring Data JPA).<br>
Participa&ccedil;&atilde;o na modelagem de banco de dados (SQL Server), integra&ccedil;&atilde;o com sistemas em Delphi 7, desenvolvimento de dashboards, aplica&ccedil;&atilde;o de boas pr&aacute;ticas e apoio em documenta&ccedil;&atilde;o.</p>

        <h3>TCI</h3>
        <p>Atua&ccedil;&atilde;o no desenvolvimento e manuten&ccedil;&atilde;o de sistemas de controle operacional de ambul&acirc;ncias. Desenvolvimento em Pascal com Delphi 5/7, banco Firebird (IBExpert), otimiza&ccedil;&atilde;o de processos, suporte t&eacute;cnico e valida&ccedil;&atilde;o com equipe operacional.</p>

        <h3>Nissei Inform&aacute;tica</h3>
        <p>Atendimento como Auxiliar T&eacute;cnico de Inform&aacute;tica entre 2011 e 2014. Principais atividades:<br>
        - Vendas de produtos de inform&aacute;tica;<br>
        - Manuten&ccedil;&atilde;o de computadores e configura&ccedil;&atilde;o de sistemas;<br>
        - Suporte a sistemas online, garantindo funcionalidade e atendimento ao cliente.</p>
      </div>

      <div class="section">
        <h2>Certifica&ccedil;&otilde;es</h2>
        <ul>
          <li>ITIL 4 (2025 - 2028)</li>
          <li>SCRUM Foundations (2025)</li>
          <li>AWS Practitioner (2024 - 2027)</li>
          <li>Oracle Cloud Foundation (2023)</li>
          <li>Lifelong Learning (2022)</li>
          <li>DevOps Essentials (2020)</li>
          <li>Scrum Foundations (2020)</li>
          <li>COBIT 5 (2018)</li>
        </ul>
      </div>

      <div class="section">
        <h2>Forma&ccedil;&atilde;o</h2>
        <ul>
          <li>UTFPR - Desenvolvimento de Sistemas JAVA (2017 - 2018)</li>
          <li>FATEC - Bacharelado em An&aacute;lise de Sistemas (2011 - 2014)</li>
          <li>ETEC - T&eacute;cnico em Inform&aacute;tica (2010 - 2011)</li>
        </ul>
      </div>

      <div class="section">
        <h2>Idiomas</h2>
        <ul>
          <li>Ingl&ecirc;s Intermedi&aacute;rio</li>
        </ul>
      </div>
    </div>
  </div>
</body>
</html>
